
&НаКлиенте
Процедура ВидКартыПриИзменении(Элемент)
	
	Если Объект.ВидКарты = ПредопределенноеЗначение("Перечисление.ВидыКартыЛояльности.Скидочная") Тогда
		
		Элементы.Скидка.Видимость = Истина; 
		Элементы.ПравилаНачисления.Видимость = Ложь;
		Элементы.ПравилаСписания.Видимость = Ложь;
		Объект.ПравилаНачисления = 0;  
		Объект.ПравилаСписания = 0;
		
	Иначе  
		
		Элементы.Скидка.Видимость = Ложь; 
		Элементы.ПравилаНачисления.Видимость = Истина;
		Элементы.ПравилаСписания.Видимость = Истина;
		Объект.Скидка = 0;
		
	КонецЕсли;
	
КонецПроцедуры
