Процедура ОтправитьСообщение() Экспорт
	
	Компонента = ПолучитьКомпонентуСервер();  
	ВидОбмена = Перечисления.ВидыОбмена.ОтправкаСообщений;
	ПараметрыОбмена = РегистрыСведений.НастройкиОбмена.ПолучитьПараметрыОбмена(ВидОбмена); 
	
	СписокСообщений = РегистрыСведений.ИсторияОбмена.СоздатьНаборЗаписей(); 
	СписокСообщений.Прочитать();
	
	Для Каждого Сообщение Из СписокСообщений Цикл  
		
		Попытка
			Компонента.Connect(
			ПараметрыОбмена.Адрес,
			ПараметрыОбмена.Порт,
			ПараметрыОбмена.Логин,
			ПараметрыОбмена.Пароль,
			ПараметрыОбмена.ВиртуальныйХост);
			
			ТочкаОбмена    = ПараметрыОбмена.ТочкаОбмена;
			ИмяОчереди     = ПараметрыОбмена.ИмяОчереди;
			ТекстСообщения = Сообщение.Сообщение;
			КлючМаршрутизации = ПараметрыОбмена.КлючМаршрутизации;
			
			Компонента.BasicPublish(
			ТочкаОбмена,
			КлючМаршрутизации,
			ТекстСообщения,
			1,
			Ложь);
						
		Исключение
			СистемнаяОшибка = ОписаниеОшибки();
			ТекстСообщения = "Ошибка отправки сообщения!%СистемнаяОшибка%";
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%СистемнаяОшибка%", СистемнаяОшибка);
			ВызватьИсключение ТекстСообщения;
		КонецПопытки;      
		
	КонецЦикла;
	СписокСообщений.Очистить(); 
	СписокСообщений.Записать();
		
КонецПроцедуры

Функция ПолучитьКомпонентуСервер()

	Компонента = Неопределено;
	Если Не ИнициализироватьКомпоненту(Компонента) Тогда
		
		ПодключитьКомпоненту();
		ИнициализироватьКомпоненту(Компонента);
		
	КонецЕсли;
	
	Возврат Компонента;	
	
КонецФункции 


Процедура ПрочитатьСообщение() Экспорт         

	Компонента = ПолучитьКомпонентуСервер();

	ВидОбмена = Перечисления.ВидыОбмена.ЧтениеСообщений;
	ПараметрыОбмена = РегистрыСведений.НастройкиОбмена.ПолучитьПараметрыОбмена(ВидОбмена);	
	
	Попытка
		Компонента.Connect(
			ПараметрыОбмена.Адрес,
			ПараметрыОбмена.Порт,
			ПараметрыОбмена.Логин,
			ПараметрыОбмена.Пароль,
			ПараметрыОбмена.ВиртуальныйХост);
		
		ИмяОчереди = ПараметрыОбмена.ИмяОчереди;
		
		Попытка
			
			Потребитель = Компонента.BasicConsume(ИмяОчереди, "", Истина, Ложь, 0);
			
			ОтветноеСообщение = "";
			Если Компонента.BasicConsumeMessage("", ОтветноеСообщение, 5) Тогда
				Компонента.BasicAck(); 
				
				ДесериализацияJSON(ОтветноеСообщение);
				
				ТекстСообщения = НСтр("ru='Сообщение успешно прочитано!'");
			Иначе
				ОтветноеСообщение = ОтветноеСообщение;
				ТекстСообщения = НСтр("ru='Очередь пустая!'");
			КонецЕсли;
			
			Компонента.BasicCancel("");
		Исключение
			ВызватьИсключение Компонента.GetLastError();
		КонецПопытки;
	Исключение
		СистемнаяОшибка = ОписаниеОшибки();
		ТекстСообщения = "Ошибка чтения сообщения!%СистемнаяОшибка%";
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%СистемнаяОшибка%", СистемнаяОшибка);
		ВызватьИсключение ТекстСообщения;
	КонецПопытки;	
	
КонецПроцедуры

#Область ПодключениеИнициализацияКомпоненты 

Функция ИнициализироватьКомпоненту(Компонента)
	
	Попытка
		Компонента  = Новый("AddIn.BITERP.PinkRabbitMQ");
		Возврат Истина;
	Исключение
		Возврат Ложь;
	КонецПопытки;
	
КонецФункции 

Процедура ПодключитьКомпоненту(КомпонентаПодключена = Неопределено)
	
	УникальныйИдентификатор = Новый УникальныйИдентификатор;
	АдресВоВременномХранилище = ПолучитьАдресМакетаКомпановкиНаСервере(УникальныйИдентификатор);
	КомпонентаПодключена = ПодключитьВнешнююКомпоненту(АдресВоВременномХранилище, "BITERP", ТипВнешнейКомпоненты.Native);
	
КонецПроцедуры 

#КонецОбласти  

#Область СлужебныеПроцедуры

Функция ПолучитьАдресМакетаКомпановкиНаСервере(УникальныйИдентификатор)
	                            
	МакетВнешнейКомпоненты    = ПолучитьОбщийМакет("RabbitMQ");
	АдресВоВременномХранилище = ПоместитьВоВременноеХранилище(МакетВнешнейКомпоненты, УникальныйИдентификатор);
	
	Возврат АдресВоВременномХранилище;
		
КонецФункции  

Процедура ОтправкаСообщенийВRabbitMQ() Экспорт
	// Вставить содержимое обработчика.
КонецПроцедуры

 
Процедура ДесериализацияJSON(JSONСтрока)
 			
	НачалоJSON = СтрНайти(JSONСтрока, "{");
	
	Длина =  СтрДлина(JSONСтрока);
	
	Объект = Сред(JSONСтрока, 0 , НачалоJSON - 1); 
	
	ТипОбъекта = Тип(Объект);

	JSONСтрока = Сред(JSONСтрока, НачалоJSON, Длина); 
	
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(JSONСтрока);
	ОбъектXDTO = СериализаторXDTO.ПрочитатьJSON(ЧтениеJSON, ТипОбъекта);   
	
	ОбъектXDTO.Записать();	

КонецПроцедуры

Процедура ПолучениеСообщенийВRabbitMQ() Экспорт
	// Вставить содержимое обработчика.
КонецПроцедуры


#КонецОбласти
