#Область СлужебныйПрограммныйИнтерфейс

Процедура ИсполняемыеСценарии() Экспорт
    
   ЮТТесты.ДобавитьТестовыйНабор("Программа лояльности")
		.ДобавитьТест("ПолучитьПрограммуЛояльностиПозитив", "Получить программу лояльности", "Позитив")
		.ДобавитьТест("ПолучитьПрограммуЛояльностиНегатив", "Получить программу лояльности", "Негатив")  
		.ДобавитьТест("РассчитатьСкидкуПозитив", "РАссчитать скидку", "Позитив")
	;

КонецПроцедуры

Процедура ПолучитьПрограммуЛояльностиПозитив() Экспорт
	
	ВидКарты = Перечисления.ВидыКартыЛояльности.Накопительная;
	
	ПрограммаЛояльности = Справочники.ПрограммыЛояльности.ПолучитьПрограммуЛояльности(ВидКарты);
	
	ПравилаНачисления = ПрограммаЛояльности[0].ПравилаНачисления; 
	ПравилаСписания = ПрограммаЛояльности[0].ПравилаСписания;
	
	ЮТест.ОжидаетЧто(ПравилаНачисления)
		.Равно(15);
		
КонецПроцедуры  

Процедура ПолучитьПрограммуЛояльностиНегатив() Экспорт
	
	ВидКарты = Неопределено;
	
	ПрограммаЛояльности = Справочники.ПрограммыЛояльности.ПолучитьПрограммуЛояльности(ВидКарты);
	
	ЮТест.ОжидаетЧто(ПрограммаЛояльности)
	.ИмеетТип("Неопределено");
	
КонецПроцедуры   

Процедура РассчитатьСкидкуПозитив() Экспорт
		
	Количество = 10;
	Цена = 1500;
	Скидка = 20;
	
	Сумма = Документы.РасходТовара.РассчитатьСкидку(Количество, Цена, Скидка);	
	
	ЮТест.ОжидаетЧто(Сумма)
	.Равно(12000);
	
КонецПроцедуры 	

#КонецОбласти

