Функция ПолучитьПрограммуЛояльности(ВидКарты) Экспорт
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ИсторияПрограммЛояльностиСрезПоследних.ПрограмммаЛояльности.Скидка КАК Скидка,
	|	ИсторияПрограммЛояльностиСрезПоследних.ПрограмммаЛояльности.ПравилаНачисления КАК ПравилаНачисления,
	|	ИсторияПрограммЛояльностиСрезПоследних.ПрограмммаЛояльности.ПравилаСписания КАК ПравилаСписания
	|ИЗ
	|	РегистрСведений.ИсторияПрограммЛояльности.СрезПоследних(&Дата, ВидКартыЛояльности = &ВидКартыЛояльности) КАК ИсторияПрограммЛояльностиСрезПоследних";
	
	Запрос.УстановитьПараметр("Дата", ТекущаяДата());   
	
	Запрос.УстановитьПараметр("ВидКартыЛояльности", ВидКарты);
	
	Результат = Запрос.Выполнить(); 
	
	Если Результат.Пустой() Тогда
		Возврат Неопределено;
	Иначе	
		Возврат Результат.Выгрузить();	
	КонецЕсли;
			
КонецФункции