Функция ПолучитьПараметрыОбмена(ВидОбмена) Экспорт
	
	ПараметрыОбмена = ИнициализироватьСтруктуруПараметров();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НастройкиОбмена.Адрес КАК Адрес,
		|	НастройкиОбмена.Порт КАК Порт,
		|	НастройкиОбмена.Логин КАК Логин,
		|	НастройкиОбмена.Пароль КАК Пароль,
		|	НастройкиОбмена.ВиртуальныйХост КАК ВиртуальныйХост,
		|	НастройкиОбмена.ТочкаОбмена КАК ТочкаОбмена,
		|	НастройкиОбмена.ИмяОчереди КАК ИмяОчереди,
		|	НастройкиОбмена.КлючМаршрутизации КАК КлючМаршрутизации
		|ИЗ
		|	РегистрСведений.НастройкиОбмена КАК НастройкиОбмена
		|ГДЕ
		|	НастройкиОбмена.ВидОбмена = &ВидОбмена";
	
	Запрос.УстановитьПараметр("ВидОбмена", ВидОбмена);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	ВыборкаДетальныеЗаписи.Следующий();
    ЗаполнитьЗначенияСвойств(ПараметрыОбмена, ВыборкаДетальныеЗаписи); 
	
	Возврат ПараметрыОбмена;
	
Конецфункции 

Функция ИнициализироватьСтруктуруПараметров()

	СтруктуруПараметров = Новый Структура();
	СтруктуруПараметров.Вставить("Адрес", "");  
	СтруктуруПараметров.Вставить("Порт", "");
	СтруктуруПараметров.Вставить("Логин", "");
	СтруктуруПараметров.Вставить("Пароль", "");
	СтруктуруПараметров.Вставить("ВиртуальныйХост", "");
	СтруктуруПараметров.Вставить("ТочкаОбмена", "");
	СтруктуруПараметров.Вставить("ИмяОчереди", "");
	СтруктуруПараметров.Вставить("КлючМаршрутизации", "");
	
	Возврат СтруктуруПараметров;
	
Конецфункции