
Процедура ПодпискаНаСобытие1ПриЗаписи(Источник, Отказ) Экспорт
	
	Если Источник.ОбменДанными.Загрузка Тогда
		Возврат; 
	КонецЕсли;  
	
	ЗаписьJSON = Новый ЗаписьJSON; 
	ЗаписьJSON.УстановитьСтроку();
	СериализаторXDTO.ЗаписатьJSON(ЗаписьJSON, Источник);
	ТекстСообщения = ЗаписьJSON.Закрыть();	
	
	
	Если ТипЗнч(Источник) = Тип("СправочникОбъект.ВидыЦен") Тогда
		ТекстСообщения = "СправочникОбъект.ВидыЦен" + 	ТекстСообщения;  
		
	ИначеЕсли ТипЗнч(Источник) = Тип("СправочникОбъект.Регионы") Тогда
		ТекстСообщения = "СправочникОбъект.Регионы" + 	ТекстСообщения; 
		
	ИНачеЕсли ТипЗнч(Источник) = Тип("СправочникОбъект.Контрагенты") Тогда
		ТекстСообщения = "СправочникОбъект.Контрагенты" + 	ТекстСообщения; 
		
	ИНачеЕсли ТипЗнч(Источник) = Тип("СправочникОбъект.КартыЛояльности") Тогда
		ТекстСообщения = "СправочникОбъект.КартыЛояльности" + 	ТекстСообщения;		
	КонецЕсли;
	
	
	МенеджерЗаписи = РегистрыСведений.ИсторияОбмена.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Период = ТекущаяДата();
	МенеджерЗаписи.Объект =  Источник.Ссылка;
	МенеджерЗаписи.Сообщение = ТекстСообщения;
	МенеджерЗаписи.Записать();	
		
КонецПроцедуры
